Revit 2027 API
ScheduleFilter.SetValue(String) Method
 Set the filter value to a string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValue(
	string string
)
Public Sub SetValue (
	string As String
)
public:
void SetValue(
	String^ string
)
member SetValue :
        string : string -> unit
Parameters
string String
 The filter value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace